import { Item } from '@ui/Grid';
import { Metadata } from 'next';
import { JSX } from 'react/jsx-runtime';

export const metadata: Metadata = {
  title: 'Charter',
};

function Page(): JSX.Element {
  return (
    <main className="center">
      <div>
        <Item style={{ textAlign: 'left' }}>
          <h2>1. Общие положения</h2>
          <hr />
          <p>
            1.1. В сообществе Perma4 существует разделение на два состава:{' '}
            <br />
            <br />
            1.1.1. Основной состав:
            <br />
            Состоит из участников и игроков которые пользуются исключительным
            доверием друг к другу, вне зависимости от офлайнонлайн, дисциплины.
            Принимают активные участия в существовании команды
            <br />
            <br />
            1.1.2. Второй состав:
            <br />
            Участники 2 состава обязаны принимать максимальную активность в
            проводимых тренировках, играх и сборах команды
            <br />
            <br />
            1.2. В сообществе принят принцип единоначалия, при котором командир
            (начальник) наделён всей полнотой распорядительной власти по
            отношению к подчинённым и несёт полную ответственность за все
            стороны функционирования команды.
            <br />
            <br />
            1.3. Логотип, сайт, группа в вк, дискорд-сервер, CS:GO сервер -
            обслуживаются, разрабатываются, дополняются, изменяются только по
            решению руководящего состава.
            <br />
            <br />
            1.4. Каждый участник PERMA4, без исключений, является представителем
            сообщества Dicktor_inc.
            <br />
            <br />
            1.5. Собрание руководящего состава происходит каждую последнюю
            пятницу каждого месяца, а так же для внесения коррективов,
            проведения голосований.
            <br />
          </p>
        </Item>
        <br />
        <Item style={{ textAlign: 'left' }}>
          <h2>2. Участие в команде</h2>
          <hr />
          <p>
            2.1. Участником команды PERMA4 может стать любой заинтересованный в
            этом игрок после прохождения собеседования с представителем
            руководящего состава. Окончательное решение о принятии игрока в
            состав команды может быть принято/не одобрено следующим по
            старшинству руководителем. Каждому принятому игроку назначается
            испытательный срок, период испытательного срока определяет
            руководитель, принимавший игрока.
            <br />
            <br />
            2.2. Первично игрок попадает в песочницу - первый рубеж новобранцев,
            после прохождения испытательного срока в 14 дней игрок переводиться
            во 2 состав.
            <br />
            <br />
            2.3. В основной состав игрок может быть зачислен после 3 календарных
            месяцев активного участия во втором составе, и только при
            положительной характеристике от основного состава. Наличие варнов
            недопустимо. Решение о переводе игрока в основной состав принимается
            на ежемесячном собрании руководства состава методом голосования.
            <br />
            <br />
            2.4. В команде должны поддерживаться дружеские/приятельские
            отношения. Приветствуется помощь своим тиммейтам как в играх, так и
            вне онлайн среды.
            <br />
            <br />
            2.5. В коллективе запрещается: Неуважительное отношение к другим
            участникам команды в любых его проявлениях. Использование
            вспомогательного софта (Читы) в любых играх с системой античита.
            Использование нецензурной лексики и оскорбительных словосочетаний в
            игровом псевдониме (никнейм).
            <br />
            <br />
            2.6. В случае неподобающего поведения и/или нарушения правил
            игроком, ему выдаётся предупреждение (варн). Решение о присвоении
            предупреждения принимается любым из членов руководящего состава.
            Варн активен 14 календарных дней, после чего сгорает. В случае
            получения второго варна в течение действия первого, действие первого
            предупреждения пролонгируется до окончания срока действия второго
            варна. При получении 3-х активных варнов - игрок исключается из
            команды, с правом восстановиться через 1 календарный месяц.
            <br />
            <br />
            2.7. В случае, если участник команды попадает в список VAC, он без
            предупреждения дисквалифицируется из команды. При этом, дальнейшее
            использование Логотипа и клан-тега команды на своём профиле
            запрещается. Роль
            <br />
          </p>
        </Item>
        <br />
        <Item style={{ textAlign: 'left' }}>
          <h2>3. Игровой процесс</h2>
          <hr />
          <p>
            3.1. Определение состава на матч осуществляется старшим/руководящим
            составом. В случае количества желающих, превышающего число игровых
            слотов в матче - предпочтение отдается игрокам основного состава.
            <br />
            <br />
            3.2. Участникам обоих составов предпочтительно знать (изучать)
            раскиды, углы прострелов, и остальные тонкости игры.
            <br />
            <br />
            3.3. Во время игр в ММ - старший по должности игрок является
            капитаном команды в данном конкретном матче.
            <br />
            <br />
            3.4. Приказ, просьба, команда капитана - не обсуждается и
            исполняется с максимальной эффективностью. В случае систематического
            неподчинения - капитан оставляет за собой право назначить варн.
            <br />
          </p>
        </Item>
        <br />
        <Item style={{ textAlign: 'left' }}>
          <h2>4. Структура руководств</h2>
          <hr />
          <p>
            Владелец - Гриднев Владимир (Диктор).
            <br />
            Имеет полные права на распоряжение личным составом. Любая его
            просьба - приказ для участника.
            <br />
            <br />
            Управляющий, командир и руководитель основного состава - Савичев
            Кирилл (Madfun).
            <br />
            Действует исключительно в интересах команды.
            <br />
            <br />
            Первый заместитель командира - Алексей Козлов (JIexa_CAXAPOK).
            <br />
            Имеет права: рассматривать кандидатов для вступления в команду,
            принимать решения о проведении игр, выдавать предупреждения (варны).
            <br />
            <br />
            Второй заместитель командира - Анатолий Бездушный (Filin).
            <br />
            Имеет права: рассматривать кандидатов для вступления в команду,
            принимать решения о проведении игр, выдавать предупреждения (варны).
            <br />
            <br />
            ВрИО второго заместителя командира - Павел Долин (PashkaCAkashka).
            <br />
            Имеет права: рассматривать кандидатов для вступления в команду,
            принимать решения о проведении игр, выдавать предупреждения (варны)
            в случае отсутствия 2 командира.
            <br />
            <br />
            Руководитель второго состава и Тренер PERMA4 - Кирилл Стрельников
            (Testpri).
            <br />
            Имеет права: в рамках второго состава рассматривать кандидатов для
            вступления в команду, принимать решения о проведении игр, выдавать
            предупреждения (варны) и назначать тренировки.
            <br />
          </p>
        </Item>
      </div>
    </main>
  );
}

export default Page;
